{
  "BhagavadGitaChapter": [
    {
      "chapter": 3,
      "verse": 1,
      "text": "अर्जुन उवाच ।\nज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन ।\nतत्किं कर्मणि घोरे मां नियोजयसि केशव ॥३-१॥",
      "meaning": "अर्जुन ने कहा — हे जनार्दन! यदि आपको कर्म से बढ़कर बुद्धियोग (ज्ञान) श्रेष्ठ लगता है, तो फिर हे केशव! आप मुझे इस भयंकर कर्म (युद्ध) में क्यों प्रवृत्त कर रहे हैं?",
      "explanation": "अध्याय २ के अंत में भगवान ने स्थिरबुद्धि वाले ज्ञानी का वर्णन किया, जिससे अर्जुन को भ्रम हुआ कि यदि ज्ञान श्रेष्ठ है, तो कर्म क्यों करें? इसलिए वह भगवान से यह प्रश्न पूछता है। यह अर्जुन के मन में ज्ञान और कर्म के बीच उठे भ्रम को दर्शाता है।"
    },
    {
      "chapter": 3,
      "verse": 2,
      "text": "व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे ।\nतदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम् ॥३-२॥",
      "meaning": "आपके मिले-जुले वचनों से मेरी बुद्धि मानो मोहित हो रही है। इसलिए कृपया स्पष्ट रूप से एक ही बात कहिए जिससे मेरा परम कल्याण हो।",
      "explanation": "अर्जुन भगवान से विनती करता है कि वे उसे भ्रम में न रखें और एक ही मार्ग बताएं जिससे उसका कल्याण हो। उसे लगता है कि भगवान कभी ज्ञान की, तो कभी कर्म की महिमा बताते हैं। यह श्लोक अर्जुन की स्पष्टता पाने की इच्छा को दर्शाता है।"
    },
    {
      "chapter": 3,
      "verse": 3,
      "text": "श्रीभगवानुवाच ।\nलोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ ।\nज्ञानयोगेन सांख्यानां कर्मयोगेन योगिनाम् ॥३-३॥",
      "meaning": "श्रीभगवान बोले — हे निष्पाप अर्जुन! इस संसार में दो प्रकार की निष्ठाएँ मैंने पहले बताई हैं — ज्ञानयोग (सांख्य योगियों के लिए) और कर्मयोग (कर्मयोगियों के लिए)।",
      "explanation": "भगवान श्रीकृष्ण स्पष्ट करते हैं कि ज्ञानयोग और कर्मयोग दोनों ही मोक्ष के साधन हैं। ज्ञानमार्ग उन लोगों के लिए है जो त्याग और ध्यान में स्थित हैं, जबकि कर्मयोग उन लोगों के लिए है जो कर्म करते हुए भी आसक्ति से मुक्त रहते हैं।"
    },
    {
      "chapter": 3,
      "verse": 4,
      "text": "न कर्मणामनारम्भान्नैष्कर्म्यं पुरुषोऽश्नुते ।\nन च संन्यसनादेव सिद्धिं समधिगच्छति ॥३-४॥",
      "meaning": "मनुष्य केवल कर्म न करने से कर्मरहित (मोक्ष) अवस्था को प्राप्त नहीं करता, और केवल संन्यास लेने से भी सिद्धि को नहीं पाता।",
      "explanation": "भगवान बताते हैं कि केवल कर्म त्यागने से मुक्ति नहीं मिलती। सच्चा त्याग कर्म के बीच में रहकर भी निष्काम भाव से कार्य करने में है। कर्म से पलायन नहीं, बल्कि कर्म में योग ही सच्चा मार्ग है।"
    },
    {
      "chapter": 3,
      "verse": 5,
      "text": "न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत् ।\nकार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः ॥३-५॥",
      "meaning": "कोई भी मनुष्य क्षणभर भी बिना कर्म किए नहीं रह सकता, क्योंकि प्रकृति के गुणों द्वारा सबको अनिवार्य रूप से कर्म करने के लिए बाध्य किया जाता है।",
      "explanation": "यहाँ भगवान कहते हैं कि कर्म करना स्वभावजन्य है। प्रकृति के गुण हमें कर्म करने के लिए प्रेरित करते हैं, चाहे हम चाहें या न चाहें। इसलिए कर्म से भागने के बजाय, उसे ईश्वरार्पण भाव से करना ही श्रेष्ठ है।"
    }
  ]
}
