{
  "BhagavadGitaChapter": [
    {
      "chapter": 3,
      "verse": 1,
      "text": "3.1 Arjuna said  O Janardana, if You consider knowledge superior to action, then why do You urge me to engage in this terrible war, O Kesava?",
      "meaning": "Arjuna said: \"O Janardana, if you consider knowledge superior to action, why then, O Kesava, are you compelling me to perform this terrible action (war)?\"",
      "explanation": "Arjuna is confused because Krishna has described the value of knowledge (Jnana Yoga) and the characteristics of a steady-minded person. If knowledge is superior, Arjuna wonders why he is being asked to fight. This verse reflects his inner conflict between knowledge and action."
    },
    {
      "chapter": 3,
      "verse": 2,
      "text": "3.2 Arjuna said  You are speaking to me in mixed words, as if to confuse my mind. Please tell me clearly the one thing by which I may attain the highest good.",
      "meaning": "Arjuna said: \"Your words seem to be mixed and are confusing my mind. Therefore, please explain clearly the single path that will lead me to supreme welfare.\"",
      "explanation": "Arjuna politely requests clarity, as Krishna sometimes emphasizes knowledge and at other times action. He wants Krishna to explain a clear, definite path that leads to his spiritual welfare."
    },
    {
      "chapter": 3,
      "verse": 3,
      "text": "3.3 The Blessed Lord said  O Arjuna, in this world, two paths of discipline were declared by Me long ago — the path of knowledge for the sages and the path of action for the active.",
      "meaning": "The Blessed Lord said: \"O Arjuna, in this world, two kinds of disciplines (Nishthas) I have spoken of previously — the path of knowledge (for the contemplative) and the path of action (for those engaged in duties).\"",
      "explanation": "Krishna explains that both Jnana Yoga (knowledge) and Karma Yoga (action) are valid paths. Knowledge is for those focused on meditation and renunciation, while Karma Yoga is for those performing actions without attachment, harmonizing action and spiritual progress."
    },
    {
      "chapter": 3,
      "verse": 4,
      "text": "3.4 The Blessed Lord said  Not by abstaining from work does one achieve freedom from action, nor by renunciation alone does one attain perfection.",
      "meaning": "The Blessed Lord said: \"One does not attain freedom from action merely by not performing work, nor does one achieve perfection merely by renouncing action.\"",
      "explanation": "Krishna emphasizes that true renunciation is not avoiding work, but performing duty without attachment. Action in harmony with detachment and devotion leads to liberation, not mere inactivity."
    },
    {
      "chapter": 3,
      "verse": 5,
      "text": "3.5 The Blessed Lord said  No one can remain inactive even for a moment; all are compelled to act by the forces of nature inherent in them.",
      "meaning": "The Blessed Lord said: \"No one can remain inactive even for a moment, for everyone is driven to action by the forces of nature (Prakriti) inherent within them.\"",
      "explanation": "Krishna explains that performing action is inevitable, as the qualities of nature (gunas) compel all beings to act. Instead of avoiding work, one should perform their duties in a spirit of detachment and surrender to the Divine."
    }
  ]
}
